cases/NSGA_cylinder/baseCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          72;
        startFace       28035;
    }
    outlet
    {
        type            patch;
        nFaces          72;
        startFace       28107;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          58;
        startFace       28179;
    }
    lower
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          183;
        startFace       28237;
    }
    upper
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          183;
        startFace       28420;
    }
    AFC
    {
        type            patch;
        nFaces          2;
        startFace       28603;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          28320;
        startFace       28605;
    }
)

// ************************************************************************* //
