cases/NSGA_cylinder/baseCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
	    type            fixedValue;
		value           uniform (1.0 0.0 0.0);
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            fixedValue;
        value           uniform (0.0 0.0 0.0);
    }
    lower
    {
        type            symmetry;
    }
    upper
    {
        type            symmetry;
    }
    AFC
    {
		type         uniformFixedValue;
		uniformValue
		{
		  type             tableFile;
		  file             "$FOAM_CASE/0/AFCvalues";
          outOfBounds       clamp;
		}
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
