cases/NSGA_cylinder/baseCase/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes 
{
    default                         backward;
}

gradSchemes 
{
    default 						Gauss linear;
}

divSchemes 
{
    default 						Gauss linear;

    div(phi,U) 						bounded Gauss upwind;
    div((nuEff*dev(T(grad(U))))) 	Gauss linear;
    div(phi,nuTilda) 				bounded Gauss upwind;
}

laplacianSchemes 
{
    default 						Gauss linear corrected;
}

interpolationSchemes 
{
    default 						linear;
}

snGradSchemes 
{
    default 						corrected;
}

fluxRequired 
{
    default 						no;
    p ;
}
